{
    "Melbourne": {
        "1.January": {
            "Ranking": 1,
            "Summary": "Live in the Northern Hemisphere? Cancel winter’s contract and go south to Melbourne, Australia, where it’s summer. Some people say Melbourne is Australia’s coolest city—and those people are entirely correct (soz, Sydney: take solace with that massive bridge and those lovely beaches). In a more literal sense, the Victorian capital is also warm, especially in January. Expect t-shirt weather, and don’t miss the Big Three: coffee, street art and St Kilda.",
            "URL": null
        }
    },
    "Iceland": {
        "1.January": {
            "Ranking": 2,
            "Summary": "Another one where blue skies aren’t exactly guaranteed—though if you’re lucky, they might turn green once night falls. We are, of course, talking about the ethereal Northern Lights, which flood Iceland’s skies with their bewitching colours in January (and the rest of winter). Even if the clouds prove stubborn, there’s more than enough on the ground to keep you busy: majestic waterfalls, exploding geysers, pristine glaciers, and scenery that looks like a sci-fi movie set.",
            "URL": null
        },
        "8.August": {
            "Ranking": 5,
            "Summary": "There’s never a bad time to visit Iceland, right? August is the warmest month of the year here, but do remember that that means daily averages between 10 and 15 degrees celsius, so it is hardly sweltering. Still, balmy for Iceland, and visiting this gorgeous part of the world during the ubiquitously-bright summer months is an experience in itself. The grass is a little greener during August, and the warmer weather allows Iceland’s wonderful wildlife the chance to cavort through the fields. Yes, it is just like a fairytale.",
            "URL": "https://www.timeout.com/iceland/things-to-do/best-things-to-do-in-iceland"
        }
    },
    "Cape Town": {
        "1.January": {
            "Ranking": 3,
            "Summary": "Basking in the shadow of Table Mountain and perched overlooking the gorgeous Atlantic coast, South Africa’s ‘Mother City’ is a cracking place to kick the seasonal blues. From lazily perusing the boho-chic Kalk Bay area or filling your boots at the brand-newTime Out Marketto braving the dazzling heights of the ‘Boomslang’ at Kirstenbosch botanical gardens, this jewel of a city will have an enticing activity to keep you entertained in January.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Shetland, Scotland": {
        "1.January": {
            "Ranking": 4,
            "Summary": "You know at the top how we said something about blue skies? Yeah, well, that doesn’t apply here (your extremities might go blue, though!). If a holiday on a remote, rocky, rain-lashed island 200km north of northernScotlandin the North Sea sounds like your idea of something that would go quickly south, hear us out. There is a Viking Festival in January. A. Viking. Festival. It’s called Up Helly Aa, and while we’re slightly crushed we can’t yet speak from firsthand experience, it looks absolutely incredible.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Brazil": {
        "1.January": {
            "Ranking": 5,
            "Summary": "If you’ve ever glanced at a map of the world, you may have noticed Brazil is rather on the large side, meaning the kinds of temperatures you experience will depend on which part you visit. January is generally a safe bet, with an average mercury reading of 27C/78F. Start in absurdly scenicRio, draped around a mountainous natural harbour and sporting some of the world’s best beaches, before heading inland to the Amazon. Pack bug spray.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Mekong Delta, Vietnam": {
        "1.January": {
            "Ranking": 6,
            "Summary": "South East Asia’s answer toVenice, this vast, emerald patchwork of paddies is known as the rice bowl ofVietnam. The region acts as a kind of colander for the Mekong River as it drains into the South China Sea and is webbed with a dense, tropical maze of chocolate-brown waterways, teeming with villages, pagodas and floating markets. January is one of the best times to visit—warm, dry and sunny. You can hop on a 2–3 day tour starting from Ho Chi Minh City, which lies just to the north (if you book in-country, it’ll cost about the same as a 30-minute gondola ride in Venice).",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Yellowstone National Park, US": {
        "1.January": {
            "Ranking": 7,
            "Summary": "This world-famous Wyoming national park is always spectacular. It is mainly visited in warmer months, but if you can get there in January, you’ll be in for a real treat, with the whole place transformed into an other-worldly wintery wilderness. Animals are much easier to spot in the snow, with the most notable example being bison, complete with their shaggy winter coats, and the steam from the geysers is far more pronounced.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Penang Island, Malaysia": {
        "1.January": {
            "Ranking": 8,
            "Summary": "With its colonial-era, mural-adorned capital city and plenty of white sand beaches to plonk yourself down on, you could domuchworse than starting off the year on Malaysia’s Penang Island. Not to mention, January’s the perfect time to visit, as George Town becomes even more colourful than usual as Lunar New Year celebrations take over the streets. Wander around the city after dark to see its buildings lit up in a spectacular display, with Kek Lok Si Temple not to be missed.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Cuba": {
        "1.January": {
            "Ranking": 9,
            "Summary": "Basking in the heart of the Caribbean, Cuba makes for an excellent excursion from January’s wintery depths. The whole place feels like it was made for Instagram: the coasts are fringed with talc-like beaches and turquoise waters, while inland mountains lurch up from verdant plains. And then there’s the capital,Havana, with its retro cars (thanks, communism!) and salsa clubs. Your friends at home will hate you. Temperatures are supremely agreeable this time of year, hovering around the 21C/70F mark.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Zanzibar, Tanzania": {
        "1.January": {
            "Ranking": 10,
            "Summary": "Most people who hear of this place in that Tenacious D song think it sounds vaguely exotic (and probably fictional) and then forget about it. But not you. We want Zanzibar to be planted in your mind like one of the giant palm trees that line its white shores. Here’s what you need to know. It IS exotic AND real. It’s an archipelago. It’s inAfrica. It’s tropical. It’s stupendously beautiful. It’s affordable. And January is the best month to visit.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Dubai": {
        "1.January": {
            "Ranking": 11,
            "Summary": "Big, bold, brash and mind-bogglingly vertiginous, this glittering forest of skyscrapers sprouting incongruously from the Arabian Desert demands your attention. Get your bearings from the world’s tallest building, browse the souk in the Old Town by Dubai Creek, and do some dune bashing on a desert safari. Dubai’s got about as much time for winter as it does for low-key construction projects, with January temperatures idling around 25C/77F — so you might want to factor in some beach time, too.",
            "URL": "https://www.timeout.com/cape-town/things-to-do/best-things-to-do-in-cape-town"
        }
    },
    "Adelaide, Australia": {
        "2.February": {
            "Ranking": 1,
            "Summary": "There’s never really a bad time to visit SouthAustralia’s capital—the climate Down Under is generally as agreeable as its inhabitants—but if you can get to Adelaide in February, you’ll experience one of the world’s best fringe festivals. It’s second only to Edinburgh in size and scope, with over 7,000 artists contributing to over 1,000 events spread across hundreds of venues throughout the city. It runs from mid-February to mid-March.",
            "URL": "https://www.timeout.com/adelaide/things-to-do/best-attractions-adelaide"
        }
    },
    "Oaxaca, Mexico": {
        "2.February": {
            "Ranking": 2,
            "Summary": "Given Oaxaca is the food capital of Mexicoandthe metropolitan heart of a state steeped in fascinating indigenous history, it’d be an understatement to say that the city has a lot to offer. February is when temperatures finally start to warm, and the balminess in the air makes for perfect conditions to wander these colour-filled streets. Día de las Candelaria or ‘candlemas’ marks the end of the Mexican Christmas season, so make sure to arrive by February 2, grab some tamales, and get stuck into the celebrations.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        },
        "11.November": {
            "Ranking": 1,
            "Summary": "Forget your usual Halloween night out, and head to Oaxaca to experience Mexico’s Day of the Dead. From October 31 to November 2, Mexicans welcome their loved ones’ spirits back to the world of the living with a big, beautifully macabre celebration mixing both indigenous and European traditions. Big orange puffs of cempasuchil flowers line the bustling markets, altars are covered withCalaveras(decorative skulls), candles and Catholic iconography, and a massive street party kicks off with fireworks, music, dancers and performers on stilts.",
            "URL": "https://www.timeout.com/toronto/things-to-do/best-things-to-do-in-toronto"
        }
    },
    "Cape Verde": {
        "2.February": {
            "Ranking": 3,
            "Summary": "Sprinkled a few hundred kilometres off the west coast ofAfrica, Cape Verde is easy to miss. In fact, when explorers in the Middle Ages stumbled across the ten islands, they found not a soul, so it ended up being populated rather than colonised. Now it makes for a spectacular winter sun escape. Once you’ve had your fill of cocktails on the beach, head inland to explore the incredible volcanic landscapes.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Chitwan National Park, Nepal": {
        "2.February": {
            "Ranking": 4,
            "Summary": "Sprawling across the south-central region of Nepal, Chitwan National Park doubles as a World Heritage Site and is positively rammed with extraordinary wildlife. The king of this particular jungle is the Bengal tiger, and while you’re far from guaranteed to spot one (there are only 100 or so), it is one of the most likely places in the world you can. Other mammals include leopards, sloth bears, wild dogs, rhinos and even the odd elephant or two.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Laos": {
        "2.February": {
            "Ranking": 5,
            "Summary": "Laos has a hard time being noticed, with its three neighbours (Thailand,CambodiaandVietnam) relentlessly clamouring for your attention. But that’s precisely why we love it. Laos is modest, quiet and unassuming—just like the people living there. But once you peek behind the curtain of unaffectedness, you’ll discover a place of almost unimaginable beauty and depth. February is a perfect time to visit what is, in many ways, an ideal country.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Garden Route, South Africa": {
        "2.February": {
            "Ranking": 6,
            "Summary": "Sounds nice, doesn’t it? Well, we’re delighted to confirm it is. Especially in February, when the skies are blue and the temperatures balmy. Stretching approximately 300km west to east from Whitsand to Storms River along the southern coastline ofSouth Africa, the Garden Route makes for one of the world’s best mini-road trips. So named for its incredible biodiversity, the region is packed with perfect beaches, pretty towns, azure lakes and lots and lots of greenery.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Budapest, Hungary": {
        "2.February": {
            "Ranking": 7,
            "Summary": "Budapest is lovely, and you should totally visit. Generally speaking, this is a highly walkable city, with its grand, tree-lined avenues—as wide as motorways but without the traffic—but it’s perhaps best known for its ruin bars and thermal baths. The former will make hipsters feel like they’ve died and gone to heaven, and the latter are perfect for the winter months—nothing cleanses the sins of the night before like a dip in the thermal springs. It’s like your head is in a freezer with the rest of your body being in a... well, bath.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Caribbean": {
        "2.February": {
            "Ranking": 8,
            "Summary": "Could there be a better ‘up yours’ to February than carting yourself off to the Caribbean? No. The answer is \"No.\" It is the best time to visit: Sea temperatures are at a ludicrously pleasant 26C/79F, and the outside air peaks at a perfectly manageable 29C/84F. As for where to visit specifically, it is hard to go wrong inCuba,Jamaica,St Lucia, Dominica and Antigua. Or, for that matter, the Grenadines,Aruba, the British Virgin Islands and theBahamas.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Myanmar": {
        "2.February": {
            "Ranking": 9,
            "Summary": "The door to Myanmar (formerly known as Burma) was firmly shut for several decades due to political strife, but in recent years it’s become very much ajar, and you should snap up the opportunity to slip in and have a look around before the rest of the world cottons on. Unmissable sights include Bagan (an enormous ancient Buddhist complex, best seen from a hot air balloon at sunrise), Mount Popa and Shwedagon Pagoda in Yangon. Much of Myanmar’s top attractions are outdoors (or at least best viewed from the outside), and February offers the perfect weather for exploring.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Ethiopia": {
        "2.February": {
            "Ranking": 10,
            "Summary": "Ethiopia is an absolute wonderland for bucket list enthusiasts, and balmy February temperatures present an ideal time to see what it’s all about and to remind yourself that there’s far more to this country than painful moments in its history. Take the Simien Mountains, for example, a trekking paradise if ever there was one. And then there’s Lake Tana, dotted with islets and ancient monasteries. Ever seen an active volcano? Erta Ale awaits. And don’t even get us started on the wildlife.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Venezuela": {
        "2.February": {
            "Ranking": 11,
            "Summary": "ThisSouth Americanjewel has plenty going for it, but the main draw is Angel Falls, which thunder off a 979m ledge, making them the world’s highest. The wider Parque Nacional Canaima, where they can be found, is a treasure trove of other natural wonders. And that’s just the start. Rain is rare in February, while temperatures in the mid-20s/70s are not.",
            "URL": "https://www.timeout.com/oaxaca/things-to-do/essential-oaxaca"
        }
    },
    "Istanbul": {
        "3.March": {
            "Ranking": 1,
            "Summary": "One of the world’s most fascinating cities, Istanbul has one foot inEuropeand one inAsia, with the mighty Bosphorus strait dividing the city in two. While the Asian side is well worth a visit, most of the attractions can be found in the European part, from the Blue Mosque and the Grand Bazaar to the Hagia Sophia, the Topkapi Palace and plenty, plenty more. March is generally pleasant weather-wise, with sunny days and mild temperatures.",
            "URL": "https://www.timeout.com/istanbul/things-to-do/best-things-to-do-in-istanbul"
        }
    },
    "Sicily": {
        "3.March": {
            "Ranking": 2,
            "Summary": "Sure, we all know Italy as a summer vacation spot, but it does get pretty choker. Why not beat the start of the high season and head to Sicily for some springtime sun, before the temperatures reach their scorching summer heights? The breezy March weather will make for a much more enjoyable time to sample all the seafood and explore the gorgeous streets of Palermo and Catania. But it's not just the island’s cities that are worth a peruse - the vibrant town of Cefalu is home to some incredible ancient ruins and even a Norman cathedral.",
            "URL": "https://www.timeout.com/sicily/hotels/best-hotels-in-sicily"
        }
    },
    "Copenhagen": {
        "3.March": {
            "Ranking": 3,
            "Summary": "Straddling two coastal islands,Denmark’s capital makes for an excellent city break in March. You’ll want to layer up— temperatures don’t tend to exceed 5C/41F—but it’s a small price to pay to avoid the seething tourist crowds that descend later in the year. Most of the main attractions are open, from the National Museum of Denmark to Amalienborg Palace.",
            "URL": "https://www.timeout.com/copenhagen/things-to-do/best-things-to-do-in-copenhagen"
        }
    },
    "Yucatan, Mexico": {
        "3.March": {
            "Ranking": 4,
            "Summary": "The frankly glorious Mexican state of Yucatan has more world-class things to see, do and experience than some entire countries, and March is a great time to visit. Laze on paradise beaches (take your pick fromTulum,Playa del Carmen,Riviera Mayaor nearby islandCozumel), explore ancient Mayan ruins, walk around vibrant cities with stunning colonial architecture, and dive into gorgeouscenotes(azure sink-holes).",
            "URL": "https://www.timeout.com/cozumel/things-to-do/best-things-to-do-in-cozumel"
        }
    },
    "Palm Springs, California": {
        "3.March": {
            "Ranking": 5,
            "Summary": "This oasis of a city, located in theCaliforniadesert about a two hour drive east fromL.A., is a brilliant spot to soak up some spring (or late winter) sunshine (expect 27C/80F). Other than lounging by a hotel pool, a must-do is the Palm Springs Aerial Tramway, which will carry you on a rotating cable car through a majestic canyon before depositing you at a viewpoint which presents the entire Coachella Valley in all its glory.",
            "URL": "https://www.timeout.com/palm-springs/things-to-do/best-things-to-do-in-palm-springs"
        }
    },
    "Jaipur, India": {
        "3.March": {
            "Ranking": 6,
            "Summary": "Jaipur, aka the ‘Pink City’ on account of the blushed hue of its buildings, is one ofIndia’s top highlights, and March temperatures (around 30C/86F at the hottest part of the day) make it all the more agreeable. Highlights include the stupendously impressive palaces of Hawa Mahal and Jal Mahal (the latter sits in the middle of a lake), and Nahargarh Fort, which is one of the finest in a country where there’s plenty of competition.",
            "URL": "https://www.timeout.com/jaipur/things-to-do/best-things-to-do-in-jaipur"
        }
    },
    "Marrakech": {
        "3.March": {
            "Ranking": 7,
            "Summary": "Pleasing alliterations aside, there are some huge pluses to visitingMorocco’s Marrakech in March. The daytime temperatures lounge around a manageable 22C/72F, perfect for a city that begs to be explored on foot, with a tantalising maze of alleyways within the ancient medina walls (not to mention the enormous public square, Jemaa el-Fna, at the heart of it all). Get lost in one of the world’s best souks, and soak up the atmosphere of the street food stalls in the aforementioned square once evening falls.",
            "URL": "https://www.timeout.com/marrakech/things-to-do/best-things-to-do-in-marrakech"
        }
    },
    "Central America": {
        "3.March": {
            "Ranking": 8,
            "Summary": "March is one of the best times to visit Central America (the dry season runs from December to April), with balmy air and pleasant sea temperatures: Trek toBelizefor splendid coral reefs; Guatemala has beautiful Lake Atitlan; Nicaragua, with its surfable volcanoes (bucket list anyone?); andCosta Rica's jaw-dropping biodiversity. It’ll be a trip to remember.",
            "URL": "https://www.timeout.com/costa-rica/things-to-do/best-things-to-do-in-costa-rica"
        }
    },
    "Austin, Texas": {
        "3.March": {
            "Ranking": 9,
            "Summary": "TheTexancapital has firmly established itself as the live music capital of the world (to borrow its self-awarded slogan), and the corresponding highlight that is SXSW occurs in March (March 10-19 in 2023, to be exact). Other than the music scene, there’s a huge amount to experience here, especially outdoors: the city boasts 300 or soparks, and many miles of urban walking and cyclingtrails. It’s also absurdly friendly, and has an awesomefood truckscene.",
            "URL": "https://www.timeout.com/austin/things-to-do/best-things-to-do-in-austin"
        }
    },
    "Borneo": {
        "3.March": {
            "Ranking": 10,
            "Summary": "The South East Asian island of Borneo, shared betweenIndonesia,Malaysiaand Brunei, forms one of the most wonderful natural environments Planet Earth has on offer. Its most famous residents are its orangutans, which can be seen in abundance in their natural jungle home, but there are plenty of other reasons to visit: you can swim with turtles, hike up mountains, and explore jaw-dropping caves.",
            "URL": "https://www.timeout.com/travel/sustainable-travel-how-to-be-a-better-tourist"
        }
    },
    "Costa Rica": {
        "4.April": {
            "Ranking": 1,
            "Summary": "Sun worshippers, get your buns to Costa Rica. April is the hottest month of the year here, with temperatures hovering in the late 30s (centigrade), and there isn’t much in the way of rain to break the cycle. That makes it the perfect time to explore the beaches before finding shade in the enchanting old towns, before the onset of wetter weather in May and June. Don’t forget the sun cream, whatever you do.",
            "URL": "https://www.timeout.com/costa-rica/things-to-do/best-things-to-do-in-costa-rica"
        },
        "12.December": {
            "Ranking": 7,
            "Summary": "In case you haven't heard, nature immersion and eco-tourism are big, and Costa Rica might be the most eco of them all. It is well on its way to hitting its target of being the first carbon-neutral country, and a quarter of the country is made up of unspoilt conservation land. Expect fascinating nature, from vividly hued birds and tree frogs to blissed-out sloths. Eco-lodge-hop your way from the cloud forest at San Gerardo de Dota to the whale’s tail-shaped Marino Ballena National Park to surf spot Santa Teresa.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Lake Tahoe, USA": {
        "4.April": {
            "Ranking": 2,
            "Summary": "April is the perfect middle-ground month for visiting Lake Tahoe. Fewer visitors, longer days, the same old beauty. What’s not to like? Lake Tahoe is peeking out of its burrow once spring comes around, and there is something truly magical about being one of the first on the scene. A decent amount of snow remains, so skiing is still an option, although rising temperatures allow for charming walks and all the rest.",
            "URL": "https://www.timeout.com/south-lake-tahoe/things-to-do/things-to-do-in-south-lake-tahoe"
        }
    },
    "Beirut, Lebanon": {
        "4.April": {
            "Ranking": 3,
            "Summary": "Once known as the ‘Paris of the East’ but then devastated through years of civil strife, the Lebanese capital of Beirut has had a tumultuous few years but remains loved by locals and tourists alike for being one of the most vibrant, cosmopolitan and liberal cities in theMiddle East. April is a fabulous time to get out on foot—stroll the Corniche, or meander around Byblos just to the north.",
            "URL": "https://www.timeout.com/south-lake-tahoe/things-to-do/things-to-do-in-south-lake-tahoe"
        }
    },
    "Japan": {
        "4.April": {
            "Ranking": 4,
            "Summary": "Yes, April is easily the most popular time to visit Japan – but there’s a very, very good reason for that. Cherry blossom – orsakura, in Japanese – sweeps up the country from mid-March all the way through to May, cloaking the nation in a dusting of ridiculously pretty pink ‘n’ white petals. The season kicks off in the warmer south (Fukuoka, Kyushu and the like), before working its way north through Kansai, Kanto, Tohoku and finally Hokkaido. Hunting the blossom northwards is a great way to see the length of Japan – and now the country is finally fully reopened, there’s nothing to stop you!",
            "URL": "https://www.timeout.com/tokyo/things-to-do/88-things-to-do-in-tokyo"
        },
        "7.July": {
            "Ranking": 12,
            "Summary": "Following the country’s reopening last year,Japan’s capital Tokyo and other key sights have reverted back to the norm, although that still means hot and busy. So if you can, make time earlier in the month to explore the likes ofKyoto,Osakaand Hiroshima, as well as lesser-known spots such as Shiretoko Peninsula or Hateruma Island. Or, if you’re shorter on time, stick today trips from the cityand complete your own athletic feats bysummiting Mount Fujior catching some waves in surf town Kamakura.",
            "URL": "https://www.timeout.com/california/things-to-do/best-california-road-trip"
        }
    },
    "Belize": {
        "4.April": {
            "Ranking": 5,
            "Summary": "Belize may not have much landmass, but what it lacks in quantity, it more than makes up for in quality. It has its very own barrier reef (second only in size toAustralia’s more famous one), which is where you’ll find the iconic Great Blue Hole. Inland await ancient Mayan ruins, and it is all pleasantly balmy in April.",
            "URL": "https://www.timeout.com/tokyo/things-to-do/88-things-to-do-in-tokyo"
        }
    },
    "Porto": {
        "4.April": {
            "Ranking": 6,
            "Summary": "Ah, Porto. Land of steep hills, the beautifully tiled Sao Bento station, and a city centre packed to the rafters with quaint and colourful houses (which are Unesco protected). But what is the city most known for? Port, of course! And April isthetime to pay a visit to where all that glorious stuff is produced. Head to Porto for a weekend and make sure to book a trip into the absolutely dazzling Douro Valley to learn all about how the ruby, tawny and white ports are made. And if the sun comes out while you’re back in town, grab a port-tonic from one of the many, many roof terrace bars.",
            "URL": "https://www.timeout.com/porto/things-to-do/the-best-things-to-do-in-porto"
        }
    },
    "North Macedonia": {
        "4.April": {
            "Ranking": 7,
            "Summary": "The ‘undiscovered’ tag attached to the Balkans is a misnomer (the summer crowds in Sarajevo, Belgrade, and the rest are proof of that), but North Macedonia remains bizarrely off the radar of most travellers. Head here in April to find your new favourite place, from the consul architecture of Bitola to the mountain beauty and monuments of Kruševo, via shimmering Lake Ohrid, kitschy capital Skopje and more. The mosque in Tetovo might be the most beautiful in the entire region.",
            "URL": "https://www.timeout.com/porto/things-to-do/the-best-things-to-do-in-porto"
        }
    },
    "Hawaii, USA": {
        "4.April": {
            "Ranking": 8,
            "Summary": "Hawaii enjoys beautiful weather and comfortable temperatures year-round, with temperatures reliably staying above 26C/79F and below 31C/88F. April, however, is a particularly pleasant time to visit, slipping in between the spring and summer vacation seasons. The entire Hawaiian archipelago comprises over 100 islands, and the top draws includeMaui,OahuandKauai.",
            "URL": "https://www.timeout.com/porto/things-to-do/the-best-things-to-do-in-porto"
        }
    },
    "Stockholm, Sweden": {
        "4.April": {
            "Ranking": 9,
            "Summary": "This ridiculously stylishSwedishcity, spread across numerous islands linked by over 50 bridges, is a delight to visit in April: temperatures are still chilly (7C/44F, so dress warmly), but days are often bright and sunny, and by the end of the month have doubled in length (8 hours of light) compared to the start ofMarch. Other than the views of the city itself, top attractions include the Nobel Museum and Storkyrkan Cathedral, a 13th-century masterpiece.",
            "URL": "https://www.timeout.com/porto/things-to-do/the-best-things-to-do-in-porto"
        }
    },
    "Venice, Italy": {
        "4.April": {
            "Ranking": 10,
            "Summary": "Venice, Venice, Venice. What else is there to say about arguably Europe’s most popular tourist destination? The famous city can get a little claustrophobic in summer, but spring is a surprisingly accessible time for this place. Sure, there are still plenty of people, but the air is a little thinner and the streets a little quieter, making it easier to find a way under the skin of Venice and into its poetic soul. Prices are a little lower too, which is never bad here.",
            "URL": "https://www.timeout.com/venice/things-to-do/best-things-to-do-in-venice"
        }
    },
    "San Diego, USA": {
        "4.April": {
            "Ranking": 11,
            "Summary": "With temperatures practically guaranteed to idle around the 20C/68F mark (combined with plenty of sunshine), San Diego is a fine choice for April. Sandwiched quietly between the busyness of spring breaks and summer tourist season, the best things to see and do—like Balboa Park, the San Diego Zoo and the USS Midway Museum—can be experienced in relative tranquillity.",
            "URL": "https://www.timeout.com/venice/things-to-do/best-things-to-do-in-venice"
        }
    },
    "Spain": {
        "4.April": {
            "Ranking": 12,
            "Summary": "Spain encompasses a vast region and topography, so the April climate will depend on where you go, but generally speaking, coastal areas—which include the Catalonian capital ofBarcelona—are balmy, enjoying temperatures of around 20C/68F (brave travellers can enjoy sea-swimming). Further south, the beautiful Andalusia region is even warmer, though still comfortable enough to explore on foot its pretty villages, like Frigiliana, before the stifling heat of summer arrives.",
            "URL": "https://www.timeout.com/venice/things-to-do/best-things-to-do-in-venice"
        }
    },
    "Washington D.C., USA": {
        "4.April": {
            "Ranking": 13,
            "Summary": "WhileJapan’s cherry blossom season seems to grab most of the world’s attention, Washington D.C. has a pretty good one too, which typically spans late March into early April. The best place to see it is the Tidal Basin, where over 3,000 trees transform into radiant blooms. The weather can be slightly unpredictable at this time of year, swinging between cold rainy days and warm sunny ones, so keep an eye on the forecast before you jet off.",
            "URL": "https://www.timeout.com/washington-dc/things-to-do/best-things-to-do-in-washington-dc"
        }
    },
    "Hokkaido, Japan": {
        "5.May": {
            "Ranking": 1,
            "Summary": "Too late forJapan’s famed April cherry blossoms? Fear not. Up north in Hokkaido, sakura flower a month later than they do elsewhere, bringing the island to life in early May. Matsumae Park is one of the best places to spot them; it has around 250 varieties of cherry blossom and 10,000 trees to marvel at. Later in the month, shibazakura (pink moss) blankets vast swathes of the countryside—Higashimokoto Park even holds a festival dedicated to the otherworldly flower.",
            "URL": "https://www.timeout.com/washington-dc/things-to-do/best-things-to-do-in-washington-dc"
        }
    },
    "Athens, Greece": {
        "5.May": {
            "Ranking": 2,
            "Summary": "May in Athens is the perfect time to have the city’s playground of ancient ruins to yourself before the summer months’ unbearable heat and equally unbearable crowds descend on the city. Though a city steeped in ancient history, Athens is also home to a number of trendy bars and cafés and an innovative art scene with a range of exciting contemporary arts galleries. Heaven for history buffs and foodies alike, once you’ve had your fill at the Acropolis and Temple of Poseidon, fill your appetite with some souvlaki or the innumerableexcellent restaurants in Athens. Or simply whittle away your time walking the streets of any number of the charming neighbourhoods in this constantly evolving cultural capital.",
            "URL": "https://www.timeout.com/athens/travel/a-weekend-in-athens"
        }
    },
    "Utrecht, Netherlands": {
        "5.May": {
            "Ranking": 3,
            "Summary": "Hailed as the cosier version of Amsterdam, Utrecht has many of the same selling points of canals and pretty Dutch architecture, but with fewer crowds and marginally lower costs. And as Amsterdam surges its tourist tax this year, it may be time to pay a visit to ‘Little Amsterdam’ instead. A split-level university city, Utrecht is modern cool meets Medieval. May’s moderate, if still a little chilly weather is a great time to explore the number of cool independent boutiques and lively cafés and bars in the city's car-free Old Town.Feeling active? Climb the 465 steps of the Dom Tower, the Netherlands’ highest church tower, for some well-deserved outstanding views of the city below.And to quench your thirst from all that walking, sip on some Belgian beer at café Olivier, a converted church-turned-pub.",
            "URL": "https://www.timeout.com/netherlands/travel/best-netherlands-cities-to-visit"
        }
    },
    "West Coast, Australia": {
        "5.May": {
            "Ranking": 4,
            "Summary": "Want epic beaches and unforgettable wildlife encounters? Buckle up for a road trip alongAustralia’s West Coast, where you can spot stingrays, dolphins, Australian sea lions, fairy penguins and more. In Ningaloo Marine Park, May is prime time to dive with whale sharks (the largest fish in the world), and there’s even an annual whale shark festival in Exmouth. On Rottnest Island, a 30-min ferry fromPerth, you’ll find quokkas and their young. The island is car-free, so hiring a bike is a great way to get around.",
            "URL": "https://www.timeout.com/netherlands/travel/best-netherlands-cities-to-visit"
        }
    },
    "Paris, France": {
        "5.May": {
            "Ranking": 5,
            "Summary": "May might just be the perfect month to go to Paris. The weather is mild, spring blossoms burst into colour, and the summer crowds are still weeks away. Culture lovers are spoilt; La Nuit des Musées (on the third Saturday of May) grants visitors free entry to the city’s museums, which stay open late for the occasion. Elsewhere, Tous à l’Opéra offers free concerts and theatre tours, and the Jazz Festival in Saint Germain des Prés gets toes tapping with free performances and workshops.",
            "URL": "https://www.timeout.com/netherlands/travel/best-netherlands-cities-to-visit"
        }
    },
    "Wales": {
        "5.May": {
            "Ranking": 6,
            "Summary": "It would be disingenuine of us to promise perfect weather in Wales in May. Truth be told, it’ll probably rain a decent amount of the time, but the drizzle will be accompanied by warmer temperatures and the occasional blast of glistening sunshine, making May the best time of year to tackle the great Welsh Bucket List. That means climbingSnowdon, exploringPortmeirion, getting absolutely blitzed inCardiffand maybe, just maybe, walking the entire Wales Coastal Path. That’ll take more than a month, but see how far you can get before June arrives.",
            "URL": "https://www.timeout.com/netherlands/travel/best-netherlands-cities-to-visit"
        }
    },
    "Lisbon, Portugal": {
        "5.May": {
            "Ranking": 7,
            "Summary": "Lisbon is one of the best cities on the planet to travel to year-round, but visiting in May presents the extra opportunity to grab a surfboard and hop on the waves when the coast is still pretty clear. Surf town Ericeira (less than an hour from Lisbon) has beginner-friendly waves. Just be warned –Portugal’s Atlantic waters are typically colder than those in the Med and are still pretty chilly in May — but don’t let that stop you.",
            "URL": "https://www.timeout.com/lisbon/things-to-do/the-best-things-to-do-in-lisbon"
        }
    },
    "Nepal": {
        "5.May": {
            "Ranking": 8,
            "Summary": "If you’re unsure what time of year to make the pilgrimage to Nepal, consider May. After all, the weather is just about as pleasant as it gets, and two of the country’s biggest festivals take place during the unofficial best month of the year. Tiji Festival is a celebration of the (presumed) triumph of good over evil, while Buddha Jayanti is a colourful love letter to the life and times of Gautam Buddha. If you need more than two massive festivals, remember that the temples of Bhaktapur are arguably at their most accessible during May.",
            "URL": "https://www.timeout.com/lisbon/things-to-do/the-best-things-to-do-in-lisbon"
        }
    },
    "Florence, Italy": {
        "5.May": {
            "Ranking": 9,
            "Summary": "If you’re after the certainty of a good time, Florence never disappoints. There’s a certain romance (no offence Paris) about this European epicentre of art, food, wine and, lest we forget, Negronis. Fill your arty boots by visiting Renaissance classics at the Uffizi – where the gallery itself is a work of art – and Michelangelo’s David at the Accademia, then visit his and other famous Florentines graves (the likes of Galileo and Machiavelli) at the jaw-dropping Santa Croce basilica. It’s hard to miss the Cathedral of Saint Mary of the Flower (or the Duomo) at the city centre, and climbing its 463 steps is totally worth it for the vista at the top across Florence’s terracotta rooftops.",
            "URL": "https://www.timeout.com/florence/restaurants/best-florence-restaurants"
        }
    },
    "Memphis, USA": {
        "5.May": {
            "Ranking": 10,
            "Summary": "There are plenty of reasons to get giddy about visiting Memphis in May, but the creatively-named Memphis in May festival might just be right at the top of that list. A month-long festival (unsurprisingly, held throughout May), each year sees a different country from around the world celebrated through live events, exhibitions, screenings, performances and art. 2023 is Malaysia’s time to shine, so expect a whole lot of colour in Memphis this May.",
            "URL": "https://www.timeout.com/florence/restaurants/best-florence-restaurants"
        }
    },
    "Los Angeles, USA": {
        "5.May": {
            "Ranking": 11,
            "Summary": "In Los Angeles, May is all about the anticipation of summer: the weather is heating up but isn’t scorching, and the key sites are nowhere near as busy as they’ll be inJulyandAugust.Memorial Day weekend(27-29 May) packs a punch with parades, street festivals and alfresco concerts. And if you need even more glitz and glamour, there’s always the eleganza extravaganza that isRuPaul’s DragCon(12-13 May).",
            "URL": "https://www.timeout.com/florence/restaurants/best-florence-restaurants"
        }
    },
    "Sydney, Australia": {
        "5.May": {
            "Ranking": 12,
            "Summary": "Sydney may be on the cusp of winter, but don’t let that deter you; days are mild and often sunny, and the high season crowds are long gone. The sea’s a bit nippy, but it’s still a lovely time for beachcombing and coastal walks; pick a portion of the 80-kilometreBondi to Manly trail, or tackle the lot over a few days. Back in the city centre, don’t missVivid Sydney, a luminous festival of light, music and ideas.",
            "URL": "https://www.timeout.com/florence/restaurants/best-florence-restaurants"
        }
    },
    "Okavango Delta, Botswana": {
        "5.May": {
            "Ranking": 13,
            "Summary": "If you’re keen to channel your inner Attenborough, now is the time. Botswana’s dry season is just beginning, meaning landscapes are still reasonably green, days are rain-free (if a little cold at night), and the skies are clear. Wildlife spotting is pretty much on a par with the high season; as the floods retreat, the Big Five (along with giraffes, zebra and hippo) converge at watering holes across the Okavango Delta. Pair a safari with a trip to Victoria Falls, which will be at its most thunderous.",
            "URL": "https://www.timeout.com/florence/restaurants/best-florence-restaurants"
        }
    },
    "Albania": {
        "6.June": {
            "Ranking": 1,
            "Summary": "With beaches to match Greece,music festivalsto match Glastonbury, prices to match, er, a happy wallet, and all without heaving crowds, Albania is gaining speed asthealternative beach hol destination, and for good reason. This year’s probably the final year to go before the masses get wind of this relatively untouched country with a fascinating history. Albania might still not be the most easily accessible place to visit, with only one major international airport in capital Tirana, but this offers an opportunity to travel along the coast or drive through the mountains and soak in its unspoilt and ruggedly beautiful landscape.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Langkawi, Malaysia": {
        "6.June": {
            "Ranking": 2,
            "Summary": "It’s technically the rainy season on Malaysia’s west coast in June, but showers on Langkawi are short-lived, and sunshine often prevails. The main benefits of coming here in the shoulder season? Deserted attractions and bargain hotel stays. Popular Pantai Cenang beach is much quieter in June, while pretty Tanjung Rhu (which is far from the tourist hubs) can be practically empty. Take the cable car to the Skybridge on a blue-sky day for unforgettable jungle views.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Fiji": {
        "6.June": {
            "Ranking": 3,
            "Summary": "June is technically Fiji’s winter, but temperatures still hover in the mid-twenties (mid-seventies Fahrenheit), and this ‘cool’ weather makes for seriously epic sunsets. The archipelago’s turquoise waters are particularly clear at this time of year, ideal for snorkelling and diving. Viti Levu’s outer islands are a top choice for experienced divers looking for a liveaboard trip, while the Mamanucas boast calm seas and beautiful coral reefs. Resorts are getting busier, but you’re still likely to find a better deal than you would inJulyorAugust.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Scottish Highlands": {
        "6.June": {
            "Ranking": 4,
            "Summary": "Time to get rugged. Nowhere in the UK does ‘rugged’ as naturally as the Scottish Highlands, but even the rough terrain of these northern behemoths takes a break in June. The sun even makes a brief appearance here during June, making it the perfect time to explore as much of the region as possible without having to make a break for shelter at every turn. The midges are yet to show up in force, and eagle-eyed visitors might even get to spot a dolphin or two frolicking in the waters.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Seattle, USA": {
        "6.June": {
            "Ranking": 5,
            "Summary": "Whether you come for a grunge pilgrimage, that gum wall or the incredible great outdoors, Seattle’s distinct identity draws crowds from far and wide. The city’s fun-loving side is usually on full display in June as the artsy Fremont Solstice Parade stops traffic with a naked bike ride, and Seattle Pride paints the streets all colours of the rainbow. Other highlights include orca spotting in Puget Sound or sniffing out the costly-but-coveted Copper River salmon at Pike Place Market (only available fromMayuntil mid-June).",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        },
        "8.August": {
            "Ranking": 7,
            "Summary": "The Pacific Northwest has a reputation for being, how do we say this, a little bit drizzly. What is the best way to ensure good weather when visiting? Nothing is certain in this life, of course, but heading to Seattle and its surroundings in August is your best bet. The warm weather means outdoor activities aplenty, from city markets and food festivals to embracing nearby nature, while the ferries are also at their busiest during this time.",
            "URL": "https://www.timeout.com/seattle/things-to-do/best-things-to-do-in-seattle"
        }
    },
    "Prague, Czech Republic": {
        "6.June": {
            "Ranking": 6,
            "Summary": "In the past, the cramped Old Town streets of Prague in summer have tended to provoke whispers of ‘overtourism.’ But the city is trying hard to reinvent itself –fewer pub crawls and horse-drawn carts, more culture and food – and if you venture away from the main hubs, you’ll find there’s plenty to see beyond Charles Bridge and the (tourist-proofed) Lennon Wall (although they’re still worth an early morning gander). June is not yet the apex of tourist season, but benefits from beautiful weather and (in regular years) a slew of delectable festivals, including the largest ice cream fest in Central Europe and a microbrewery bonanza.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Zambia": {
        "6.June": {
            "Ranking": 7,
            "Summary": "Zambia’s dry and bright conditions in June are ideal for wildlife spotting in the 3500 square-mile South Luangwa National Park, and one big bonus; mosquito numbers dwindle as the landscape dries out. Walking safaris were first pioneered right here, allowing you to get up close to the region’s flora, identify the dusty prints of baboons, hyenas, or even leopards and see just how gargantuan African elephants really are. If that’s not enough of an adrenaline hit, make a beeline for Victoria Falls, where you can bungee jump over the Zambezi.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Boston, USA": {
        "6.June": {
            "Ranking": 8,
            "Summary": "The Bruins probably don’t have many more years of contending left in them, but that doesn’t mean that June is going to all of a sudden become a quiet time of year in the Cradle of Liberty. America’s Walking City is at its most walkable during the summer, and the mass of street festivals attest to that, while concerts and other sporting events are a constant throughout the month. There’s also the small matter of whale watching, which is never a bad thing.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        },
        "9.September": {
            "Ranking": 8,
            "Summary": "There are lots of reasons to love Boston:lobster rolls, the characterful charm that comes from being one of the oldest cities in the US, and its major-league sports teams. The city’s home to NFL legends the New England Patriots and baseball bros the Red Sox – and the seasons for both sports coincide in September, so if stadiums are welcoming the public again, you’ll be able to catch (at least) one game of each while you’re in town. Sports not your thing? Boston is a total beaut infoliage season; for a tree-mendous leaf-peeping trail, wander through thePublic Garden, then through the cobbled streets and brownstones ofBeacon Hilland along theCharles River Esplanade. And to find the best of the city in one place, visitTime Out Market Boston,which is open all year round.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "East coast, Sri Lanka": {
        "6.June": {
            "Ranking": 9,
            "Summary": "June is one of the wettest months of Sri Lanka’s southwest monsoon season (April to September) but on the east coast, it is a different story. In Arugam Bay, blazing sunshine and consistent waves mean this month is made for surfing… or lazing in a hammock with a smoothie, if that’s more your style. Nearby Kumana National Park sees far fewer visitors than its southern sister Yala, meaning you can spot leopards, elephants and crocodiles without an entourage of jostling jeeps.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Azores, Portugal": {
        "6.June": {
            "Ranking": 10,
            "Summary": "As if the Azores weren’t idyllic enough already, in June, these verdant volcanic islands in the middle of the Atlantic burst with colour as copious wildflowers come into bloom. The island of Flores (meaning flowers) is the best place to spot them, but Parque Terra Nostra on the main island ofSão Miguelis just as captivating and a real treat for botany boffins. You also stand a decent chance of spotting whales and dolphins in the wild, as the widest variety of cetacean species is migrating through these waters.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Zadar, Croatia": {
        "6.June": {
            "Ranking": 11,
            "Summary": "Truth be told, you aren’t going to be able to avoid the crowds in Dalmatia during the summer. Heck, you can barely avoid them during the spring. If you want to visit the Croatian coast in quieter times, pack that windbreaker and head here in winter. Still, Zadar and June are a gorgeous combination, and what is sneakily the most exciting town in Dalmatia puts on its best face and puckers up for the visitors. The Salutation to the Sun is one of the region’s great attractions, accentuated by a gorgeous setting sun and a crisp Brlog craft beer.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Copenhagen, Denmark": {
        "6.June": {
            "Ranking": 12,
            "Summary": "June is a great time to make the trip to Copenhagen, as arguably Europe’s most stylish city comes alive in a blur of street festivals and shimmering class. The live music schedule is packed during the middle months meaning there’s plenty of choice for gig-hunters, while the Photo Festival showcases some of the finest photography from the other side of the lens. Copenhagen’s weather is arguably at its most enjoyable in June, which is reason enough to schedule a visit for this time.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Kyrgyzstan": {
        "6.June": {
            "Ranking": 13,
            "Summary": "Current events notwithstanding, centralAsiais having a moment. Relaxed visa regulations mean the region is more accessible than ever, and its unparalleled combo of rich history, dazzling architecture and rugged landscapes are starting to draw a savvy crowd. From mid-June, Kyrgyzstan’s low-altitude hiking trails start to thaw out, the whitewater rafting season starts, and remote yurt camps welcome travellers looking for a digital detox. In mountainous Naryn, make time for the Kyrgyz Shyrdagy Festival, a celebration of the ancient Kyrgyz art of felt carpet making.",
            "URL": "https://www.timeout.com/europe/travel/albania-best-places-to-visit"
        }
    },
    "Amsterdam, Netherlands": {
        "7.July": {
            "Ranking": 1,
            "Summary": "July in Amsterdam is all about good food, good weather and good vibes. Lazy summer days are best spent hanging out in Vondelpark, where you can often catch free open-air comedy, dance and musical performances, or at Roest urban beach, which comes complete with an adult-friendly jungle gym. And although the city’s usual festivities are likely to be muted this year, keep an eye out for street food markets and events marking the city’s normally effervescent Pride season.",
            "URL": "https://www.timeout.com/amsterdam/things-to-do/best-things-to-do-in-amsterdam"
        }
    },
    "Greenland": {
        "7.July": {
            "Ranking": 2,
            "Summary": "Touted by some as ‘the newIceland’, Greenland may be more popular than ever before, but it’s still a long way behind its oversaturated sibling – all the better for those wanting to get off the beaten track. July is technically high season here, and hotels do book up fast, but this is the world’s largest (and arguably wildest) island, and there are plenty of opportunities to find relative solitude. In it for the icebergs? Join a nighttime cruise of Unesco-listed Ilulissat Icefjord (the size of 66,000 football fields), where until around the 24th of the month, the midnight sun sets a cast of creaking bergs aglow in hues of pink, purple and orange.",
            "URL": "https://www.timeout.com/amsterdam/things-to-do/best-things-to-do-in-amsterdam"
        }
    },
    "Cape Town, South Africa": {
        "7.July": {
            "Ranking": 3,
            "Summary": "Hoping to see some whales while in Cape Town? July is the beginning of whale season in this part of the world, so best to get ahead of the game and set up camp accordingly, with southern right and humpback whales most likely to show their faces at this early juncture. Elsewhere in the city, winter is at its peak, meaning mild temperatures and a charming atmosphere free of the summer sizzle. You’ll have the sights to yourself in July here.Obviously, check out the newTime Out Market Cape Townwhen you're there.",
            "URL": "https://www.timeout.com/amsterdam/things-to-do/best-things-to-do-in-amsterdam"
        }
    },
    "Udaipur, India": {
        "7.July": {
            "Ranking": 4,
            "Summary": "A popular destination for tourists, this tropical subcontinent has something to offer all year round, but in July temperatures cool down a little following May and June (but it’s still hot, don’t worry). Known as the ‘City of lakes’, Udaipur is a beautiful city in the heart of the state of Rajasthan, with historic palaces, temples, a wildlife sanctuary and a ton of markets for shopping. Be sure to spend your evenings in a rooftop cafe for fantastic food with a view. End the day sitting next to the water and soak up the tranquility.",
            "URL": "https://www.timeout.com/india/travel/best-places-to-visit-in-india"
        }
    },
    "South Island, New Zealand": {
        "7.July": {
            "Ranking": 5,
            "Summary": "With sweet ski slopes, luxury hot springs and fantastic whale watching opportunities, New Zealand’s South Island is a no-brainer when it comes to winter escapes. The coldest months also offer the chance to witness the aurora australis (southern lights) dancing along the horizon, best spotted in Dunedin close to a new moon. There are yet more reasons to look skyward in July: the rise of the Pleiades star cluster marks the start of Matariki (Maori New Year), which is celebrated with cultural festivals and feasts. Visit Mt John Observatory in Tekapo, which sits within an international dark sky reserve, for unbeatable stargazing.",
            "URL": "https://www.timeout.com/india/travel/best-places-to-visit-in-india"
        }
    },
    "Northwest England": {
        "7.July": {
            "Ranking": 6,
            "Summary": "We’ll be the first to admit that the weather in the northwest of England can be, how do we say, a little less than optimum. Drizzle persists for most of the year, but July sees the sun finally break through with all the enthusiasm of an excitable child. The big cities of the northwest follow suit, with Liverpool and Manchester in particular shining brightest when the sun is out. And while you’re there, don't miss out on The Beatles exhibition, celebrating 60 years of ‘A Hard Day’s Night’ (July 10, 2024). Sure, the north is defined by its drizzle, but you can’t beat an Aigburth beer garden on a Saturday afternoon. Throw in some excellent park festivals, and you’ve got yourself a very special part of the world indeed.",
            "URL": "https://www.timeout.com/india/travel/best-places-to-visit-in-india"
        }
    },
    "Hoi An, Vietnam": {
        "7.July": {
            "Ranking": 7,
            "Summary": "As the monsoon rains fall inHanoiand Ho Chi Minh City, savvy travellers inVietnamhead to the central coast, where the weather is dry and warm. Some of the country’s most beautiful beaches are right here, along with Unesco-listed cities and jaw-dropping national parks. Get mesmerised witnessing the Lantern Festival on 19th July in the historic port city ofHoi An, where lantern-strewn streets reveal Chinese temples and ancient teahouses. Then head out of town to laze on the stretches of white sand aroundDa Nang, brave Hai Van Pass on a motorbike tour, and visit Hue’s Imperial citadel before heading inland to see the gargantuan Phong Na Caves.",
            "URL": "https://www.timeout.com/india/travel/best-places-to-visit-in-india"
        }
    },
    "Montreal, Canada": {
        "7.July": {
            "Ranking": 8,
            "Summary": "Montreal’sCanada Daycelebrations kickstart a whole month of summer fun in a city more often associated with icy winters. The highlights usually include Sainte Catherine Street Fair (the largest in the country) and the world’s biggest international comedy festival, Just for Laughs, while Cirque Festival ensures you won’t have to bend over backwards to find street entertainment – performers from Cirque du Soleil, the National Circus School and others put on tonnes of shows to celebrate one ofQuebec’s most famous art forms. But if festival-hopping isn’t your sort of thing, fear not. July is still a great time to discover this incredible city – andfuel up courtesy of the city’s best chefs atTime Out Market Montreal.",
            "URL": "https://www.timeout.com/montreal/things-to-do/best-things-to-do-in-montreal"
        }
    },
    "Madagascar": {
        "7.July": {
            "Ranking": 9,
            "Summary": "Home to some of the most diverse wildlife on the planet, Madagascar is a joy to visit in July, when the weather is cooler and drier, making lemur spotting on rainforest treks more comfortable. Humpback whales migrate here to calve their young at this time of year – spot them in Tulear and Nosy Be, or experience the humpback whale festival on Nosy Boraha. In Morondava, the local community celebrates the island’s precious ecology with the Baobab Fosa festival, where you can spot fossa (a relative of the mongoose), and walk the dazzling Avenue of the Baobabs.",
            "URL": "https://www.timeout.com/montreal/things-to-do/best-things-to-do-in-montreal"
        }
    },
    "Singapore": {
        "7.July": {
            "Ranking": 10,
            "Summary": "Singapore is a food lover’s dream year-round, but to taste it at its best, you’ll want to head there in July. That’s when the island city celebrates its multicultural cuisine with the Singapore Food Festival. From cooking masterclasses and fine dining events to a street food extravaganza, this week-long celebration of local flavour is worth skipping breakfast for. Had enough of the heat? Find refuge in the air-conditioned malls on Orchard Road and indulge in a spot of retail therapy – the Great Singapore Sale runs nearly all month, offering great deals and steep discounts.",
            "URL": "https://www.timeout.com/montreal/things-to-do/best-things-to-do-in-montreal"
        }
    },
    "West Coast, North America": {
        "7.July": {
            "Ranking": 11,
            "Summary": "Sound the road trip klaxon!Californiaand the Pacific Northwest are calling. Apart from July 4, when roads in the US will be rammed with long weekenders on their way to family barbecues and baseball games, this month is a fine time to discover the best of the American and Canadian West Coast. Whether you want to catch some rays inSan Diego, forest bathe inOregon, tourSeattle’s street art or simply make the most ofVancouver's least rainy month of the year, this slice of North America is as diverse as its days are long. And make sure to catch Comic Con in California from 25-28 July 2024.",
            "URL": "https://www.timeout.com/california/things-to-do/best-california-road-trip"
        }
    },
    "Provence, France": {
        "7.July": {
            "Ranking": 13,
            "Summary": "From Avignon and Marseille toNice, St Tropez and Cannes, Provence is packed with historic cities and stylish towns – but don’t forget the swathes of pastoral bliss in between. Come in July to sample crisp dry rosé at Château Gassier (which usually runs outdoor tastings and a cinema under the stars in the summer months), frolic in the lavender fields around Aix en Provence and Senanque Abbey before the harvest, join the Fête Nationale celebrations in pretty much every single town and village, or catch a glimpse of Tour de France riders along the dizzyingly high trail of Mont Ventoux.",
            "URL": "https://www.timeout.com/france/things-to-do/best-places-to-visit-in-france"
        }
    },
    "Edinburgh, Scotland": {
        "8.August": {
            "Ranking": 1,
            "Summary": "There is literally no better time to finally tick Edinburgh off your bucket list than in August, when the famousEdinburgh Fringe(the biggest arts festival in the entire world) takes over the city. Be you a comedy, theatre, film or music person, the Fringe is a fun, fast, chaotic burst of all things silly and creative. There’s bars, street food, nights out and more, and we’ll be reviewing all the shows you need to know about, so keep your eyes peeled.",
            "URL": "https://www.timeout.com/edinburgh/things-to-do/the-23-great-things-to-do-in-edinburgh"
        }
    },
    "Carcassone, France": {
        "8.August": {
            "Ranking": 2,
            "Summary": "France isn’t short of cracking holiday destinations. But may I make a case for the delightful Carcassonne, which isn't (completely) overrun with tourists like some of the others? There's the famous castle, sure, which is actually a properly good tourist attraction, completely beautiful and not too busy if you go in the morning. But there’s also the beautiful Cavayére Lake just a short one-euro bus ride out of the town, which is really quiet even in peak season, and has tons of kids activities and a more kid-free area too. You can sip beers in the main square by the fountain, do a classic French food shop in the supermarché, buy ridiculously good pastries atPâtisserie Papineauand have lots (and lots) of cassoulet for dinner. You’ll also find a mixture of traditional museums and galleries showcasing local works and a number of lovely vineyards nearby. If you’ve got the car, consider a French road trip to hit Nice, Nîmes and more along the way.",
            "URL": "https://www.timeout.com/france/things-to-do/best-things-to-do-in-france"
        }
    },
    "Alaska": {
        "8.August": {
            "Ranking": 3,
            "Summary": "August is slightly rainier in Alaska than earlier summer months, but with fewer crowds and lower prices, the benefits often outweigh the weather risks. It’s a wonderful month to spot caribou, wolves and golden eagles in Denali National Park, as well as grizzly bears, who are busy hunting salmon so they can fatten up before hibernation. They also nibble on the season’s abundant berries – blueberries are particularly fat and juicy in Alaska – and you can also taste them at the annual Alyeska Berry Festival in Anchorage. Don’t miss Alaska State Fair in Palmer, which marks the last days of summer with concerts, fairground rides and street food.",
            "URL": "https://www.timeout.com/alaska/things-to-do/best-things-to-do-in-alaska"
        }
    },
    "Slovenia": {
        "8.August": {
            "Ranking": 4,
            "Summary": "Slovenia might just be Europe’s worst-kept secret. In August, the capital Ljubljana and Lakes Bled and Bohinj are packed with locals and tourists alike, but if you do want to guarantee a crowd-free trip, there are plenty of lesser-known corners of this compact country to explore. As the holiday resorts sizzle, alpine regions offer respite from the heat, making it the perfect time to climb Mount Triglav. But if you really want to get off the beaten track, head east to wander around the pretty towns of Maribor and Ptuj, or go wine tasting in the surrounding Styrian vineyards. Slovenia has gorgeous towns around every corner, from Idrija to Kamnika via Radovljica, Brežice and all the rest.",
            "URL": "https://www.timeout.com/alaska/things-to-do/best-things-to-do-in-alaska"
        }
    },
    "East Africa": {
        "8.August": {
            "Ranking": 6,
            "Summary": "All kinds of adventures await in East Africa in August. The Great Migration is in full swing, meaning wildlife-spotting opportunities abound in Kenya’s Maasai Mara and Tanzania’s Serengeti National Park, and it’s also one of the best times of year to track silverback gorillas in Uganda and Rwanda. Beach bum? Into your snorkelling and scuba diving? The weather is warm and dry (and the waters brimming with marine life) on Pemba Island and Zanzibar.",
            "URL": "https://www.timeout.com/iceland/things-to-do/best-things-to-do-in-iceland"
        }
    },
    "Sri Lanka": {
        "8.August": {
            "Ranking": 8,
            "Summary": "Beach lovers will have the pick of the sand in Sri Lanka in August, with good weather expected pretty much everywhere in the north, east and west. Lower rainfall means an altogether more relaxed time, and August also represents the tail-end of the low season in Sri Lanka, so fewer crowds. It isn’t unusual to see blue whales here at this time of year too, and who wouldn’t want to see the world’s largest animal doing its thing?",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Riga, Latvia": {
        "8.August": {
            "Ranking": 9,
            "Summary": "If you want an affordable European break in August, make it Riga. With its colourful old town and beautiful parks, it’s easy to while away the summer days here without breaking the bank. The warmest month of the year sees the capital come to life with open-air concerts, street performances, pop-up food stalls and firework shows.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Buenos Aires": {
        "8.August": {
            "Ranking": 10,
            "Summary": "It’s winter in Buenos Aires, but the low season is the best time to live like a local, as residents often escape the city during the busier summer months. Culturally the capital is very much alive and kicking, with the two-week-long Tango Festival and World Cup showcasing the best of Argentina’s national dance with free performances, workshops and talks, as well as the pro-competition.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Bosnia and Herzegovina": {
        "8.August": {
            "Ranking": 11,
            "Summary": "A word of warning; it can get pretty darn hot in Bosnia and Herzegovina in August. That is more true in Herzegovina than Bosnia (Mostar tends to hover around the 40C mark), but refreshing salvation is at hand in the shape of the country’s fantastic mountains. Hiking in Bosnia and Herzegovina is still developing, but an enthusiastic group of organisations have opened up mountains like Prenj, Maglaj (the country’s highest) and Vlašić, not to mention the Olympic mountains around Sarajevo. Keep to the trails though, for your own safety.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        },
        "10.October": {
            "Ranking": 5,
            "Summary": "Summers in Bosnia and Herzegovina are mighty hot, and the winters get pretty darn cold. You can do the maths from there, and October might be the best time to visit this remarkable country. The number of tourists drops dramatically, meaning more space to wander the enchanting old towns of Sarajevo, Mostar and the rest. Travnik’s charming collection of mosques sparkles a little brighter, while Banja Luka cements its spot as the country’s best night out. More and more people are waking up to the magic of Bosnia and Herzegovina, so make a point of visiting this October to see for yourself.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Madeira": {
        "8.August": {
            "Ranking": 12,
            "Summary": "Madeira’s mild temperatures make it a winner with travellers year-round, but summer is the best time to spot or swim with whales and dolphins, of which there are more than 20 species in the island’s waters. It’s also a fine time for scuba diving, canyoning and coasteering, as well as hiking the interior’s rugged hillside trails, which follow a network oflevadas– ingenious aqueducts constructed between the sixteenth and twentieth centuries to transport water to communities living in the southeast of the island.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Samoa": {
        "8.August": {
            "Ranking": 13,
            "Summary": "Looking for a low-key paradise isle? Samoa is blissfully free of flashy resorts and tourist traps, letting its natural and cultural riches speak for themselves. Samoa is popular with New Zealanders and Australians looking for a little winter sunshine, so book ahead to nab yourself a beach hut (known as afale) and spend your days hopping between the islands’ must-sees, including Insta-friendly To-Sua Ocean Trench, the Alofaaga blowholes and Falealupo Canopy Walk.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Bulgaria": {
        "8.August": {
            "Ranking": 14,
            "Summary": "Ready for long summer days spent partying on the beach? Make a beeline for Bulgaria’s affordable Black Sea Coast resorts, where there’s a sun lounger (and a glass of rakia) with your name on it. If you’re after a little culture, you’ll find the antidote to the region’s Irish pubs in Burgas, where the International Folklore Festival welcomes traditional singers, musicians and dancers from all over the Balkans and beyond to showcase their talents in late August. Inland, adventurous types should tackle Bulgaria’s highest peak, Mount Musala (2,925m), before the snows return.",
            "URL": "https://www.timeout.com/sri-lanka/things-to-do"
        }
    },
    "Indonesia": {
        "8.August": {
            "Ranking": 15,
            "Summary": "There are 17,000 islands inIndonesia– but few travellers venture beyondBali. August brings the best weather and the inevitable accompanying crowds, so you’re better off skipping the chaos of Kuta and yogi-saturated Ubud for underrated isles such as Sumba or Pulau Weh, both of which boast white sands, turquoise waters and cheaper accommodation. Raja Ampat in West Papua receives some rain at this time of year, but don’t let that put you off booking a homestay and exploring its dazzling coral reef.",
            "URL": "https://www.timeout.com/bali/things-to-do/best-things-to-do-in-bali"
        }
    },
    "Kyoto, Japan": {
        "9.September": {
            "Ranking": 1,
            "Summary": "Japan’s most romantic city shines brightest in September. The weather is gorgeous, and the hotel prices plummet to make up for the out-of-season demand. How this is out of season, we don’t know, but there’s no need to complain. The autumn colours are staggeringly beautiful, and the end of summer is signified by several festivals and street events. This includes theSeiryu-e Dragon Festival happening on 15 September this year, in which adancing blue dragon marches into cobbled streets. It is surrounded bymen dressed in traditional warrior clothes, and the streets are filled with music and spectacular dancing.What a sight to behold!",
            "URL": "https://www.timeout.com/singapore/travel/kyoto-guide-do-eat-stay"
        }
    },
    "Montenegro": {
        "9.September": {
            "Ranking": 2,
            "Summary": "The days of Montenegro being a little secret paradise are long gone, and Kotor is every bit as busy as Dubrovnik during summer. September, however, is a blissful time to visit as the crowds thin out and the history and culture of this fascinating little country take centre stage. Perast (just down the road from Kotor) is the pick of the coast, while culture vultures should make a beeline for Cetinje (the royal capital) and the indomitable Mount Lovćen, the final resting place of 19th-century prince-poet Njegoš.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Eswatini": {
        "9.September": {
            "Ranking": 3,
            "Summary": "A relatively new international airport and an improved network of roads across the country make travelling to and around this underrated kingdom much easier – so get in there before everyone else does. This entirely landlocked country provides excellent mountain hikes, opportunities for rafting, zip-lining and mountain biking adventures, plus there’s plenty of wildlife – especially rhinos. Visit in September for springtime flowers and to get there before the sticky summer rainy season begins in October.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "British Columbia, Canada": {
        "9.September": {
            "Ranking": 4,
            "Summary": "The jaw-to-the-floor wilderness of British Columbia is best seen in burnt amber. Fly into the outdoorsy cityof Vancouverto acclimatise, with walking trails,parksand coastal hikes close to food trucks and buzzing neighbourhoods such as ex-warehouse district Yaletown and historic Gastown (Vancouver Island is also nearby for some of the best autumn colours). Then to really feel a sense of escape, head out to the majestic forested mountains and glaciers in Northern British Columbia. Or if nature with wild swimming, local wine and a bit more proximity to civilisation is more your jam, try the Okanagan Valley. Don't miss the famous Vancouver International Film Festival while you're there.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Munich, Germany": {
        "9.September": {
            "Ranking": 5,
            "Summary": "From beer halls to underground jazz clubs and museums, the Bavarian capital has a lot going for it at any time of year – but the real party starts in September. More than six million people visit Munich to drink about two million gallons of beer every year for Oktoberfest, which arrives early in Germany. Attend it inTheresienwiese from 21 September to 6 October 2024.Over the years, the start of the folk festival has crept forward, and now the mass enjoyment of traditional German cuisine, wiener dog races, lederhosen and polka music lasts from mid-September to early October.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Cali, Colombia": {
        "9.September": {
            "Ranking": 6,
            "Summary": "Sure, Cartagena and Medellin have been filling up your Insta feed for years now, but the south of the country is still under the radar. And with its notorious local cartel bosses in jail, Cali is becomingColombia’s next big thing. Known for its smoking-hot dancing, Cali has more than 200 registered salsa schools. In September, the annual Festival Mundial de Salsa is held here, so visit for free shows, live music and spontaneous dancing in its cobbled streets as the best international salsa talent congregates in technicolour costumes to shake a collective tail feather.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Lille, France": {
        "9.September": {
            "Ranking": 7,
            "Summary": "This good-looking, underrated northern French city has a lot going for it. Beyond its cobbled streets, Flemish houses and art nouveau buildings, Lille also has some impressively sculpted modern architecture, such as the Lille Métropole Museum of Modern, Contemporary and Outsider Art and the elliptical Stade Pierre-Mauroy. While design buffs might want to hold out for the WDC street festival in December, everyone else should visit in September for Europe’s biggest flea market, Braderie de Lille, which has developed into a massive street party. It’s been going since 1127, and you know what they say: practice makes perfect. And obviously you can't visit France this year without catching a glimpse of one of the Olympic matches so check out the Paralympic Games that are taking place from28th August to 8th September 2024.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Ayia Napa, Cyprus": {
        "9.September": {
            "Ranking": 9,
            "Summary": "This small resort town is situated in Cyprus’s south-east corner, and make no mistake: it's not just for partying. There's a little bit of something for everyone here; beaches for sunbathing, great food and the city's must-sees, its archaic caves and monastery. With the temperature ranging in the mid 20's, September is the perfect time to visit this place to avoid the blazing heat and the, err, typical holiday crowd. Don’t miss the spectacular views from theCape Greco National Forest Park.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Gothenburg, Sweden": {
        "9.September": {
            "Ranking": 10,
            "Summary": "Sweden’s second city is ever-present in the upper echelons of the Global Destination Sustainability Index, thanks to its forests, parks, public transport system and the government’s push towards eco-innovation. Enjoy leafy walks in Slottsskogen or the harbour views from Keillers Park in between stops at the city’s wide choice of sustainable restaurants – try organic hotspot Taverna Averna, where they grow their own veg on the roof. Visit  theLet a Hundred Flowers Bloom exhibitonwhich features features textile works by Elsa Pärs-Berglund,Shabnam Faraee and Josefin Gäfvert. And with the Swedish government pledging £4.3 million to work on overnight train routes into Europe, there could also be an opportunity fortagskryt(train-bragging) about your sustainable holiday.",
            "URL": "https://www.timeout.com/europe/travel/best-places-to-visit-montenegro"
        }
    },
    "Türkiye": {
        "10.October": {
            "Ranking": 1,
            "Summary": "It’s an obvious summer vacay hotspot, thanks to long stretches of beach and scorching temperatures, but head to Türkiye in the autumn and I can tell you that you’ll appreciate it for a little more than its warmth. The Hagia Sophia really shines when surrounded by crispy orange leaves, and Istanbul’s alleys are a little easier to explore when it’s slightly fresher than 30C. But October is versatile, and with temperatures still teetering around the mid-twenties, it’s plenty warm enough for a swim and a sunbathe.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Valencia, Spain": {
        "10.October": {
            "Ranking": 2,
            "Summary": "Valencia might’ve been named World Design Capital back in 2022, but it’s still a darn dazzling place.The aesthetically brilliant southeastern Spanish port city is home to fantastic art museums, contemporary galleries and dazzling architecture. Explore the stark white buildings at the futuristic City of Arts and Sciences, including the uncannily stormtrooper-helmet-esque Palau de les Arts opera house and wander the modernist El Cabanyal barrio, with its tiled facades.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Philippines": {
        "10.October": {
            "Ranking": 3,
            "Summary": "Adventure travel, including diving, has grown in popularity over recent years, and the Philippines’ 7,000 islands get top marks for underwater adventures. Head to Palawan’s Coron Bay for mind-blowing wreck diving, while Anilao is one of the world’s best spots for biodiversity, meaning you might just see something that’s not even been named yet. More experienced divers can also try blackwater diving here, where you’re tethered to a boat line in the pitch-black ocean at night, with a torch, for an altogether more space-like experience. Visit once the rainy season’s out of the way, in the second half of October, to make the most of its beautiful beaches. Food more your jam? As Filipino cuisine takes root in global cities like New York and London, maybe it’s time to go eat the good stuff at the source, from vibrant ube (purple yam) ice cream to Lechon (roast suckling pig).",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Bhutan": {
        "10.October": {
            "Ranking": 4,
            "Summary": "With more than 70 percent of its land covered by forest, this Buddhist kingdom is the world’s only carbon-negative country, absorbing far more of the stuff than it produces. Travel is tightly controlled to make sure tourism remains low-impact, so it isn’t cheap—though the $200-a-day fee to be there includes all your accommodation, food and a guide (which is worth it because there’s a mythical story behind pretty much everything you encounter here). Go to get lost in pristine nature, breathe in lungfuls of clean Himalayan air and feel extra smug knowing you’re eating right too.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "New Mexico": {
        "10.October": {
            "Ranking": 6,
            "Summary": "There is more to New Mexico than desert and a certain Netflix show. Every October,Albuquerquehosts its eye-popping International Balloon Fiesta, where you can spot hundreds of technicolour hot air balloons making their spectacular ascent. Maybe it is the seemingly endless skies and epic sunrises that make it a prime location, but it has become the world’s largest balloon festival and the most photographed event on Earth. Make time to visitSanta Fe, in the foothills of the Sangre de Cristo mountains, for a mix of Spanish colonial architecture and earth-coloured historic adobe neighbourhoods, plus a comprehensive Georgia O'Keeffe Museum dedicated to her artistic legacy and American modernism.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Timisoara, Romania": {
        "10.October": {
            "Ranking": 7,
            "Summary": "This under-the-radar city, with its large public squares, leafy gardens and restored pastel-painted art nouveau architecture, makes an attractive city break that’s a far cry from the tower blocks other Romanian cities are known for. Timisoara was Romania's ‘first free city’, home of the country’s 1989 revolution to overthrow the communist dictatorship (brush up on the history at the Museum of the 1989 Revolution). Its independent spark lives on in live music venues, from intimate jazz bars to the grand opera house.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "San Francisco": {
        "10.October": {
            "Ranking": 8,
            "Summary": "San Francisco has never been one to conform, even to weather norms: for warm, sunny SF days, you’re better off visiting in spring and fall rather than summer. Time your visit for October, so once you’re done with the classics—Golden Gate Bridge,Alcatrazand the adorably blubbery sea lions atPier 39—you can soak up the vibes at theHardly Strictly Bluegrass Festival. In true independent San Francisco spirit, the festival is entirely non-commercial (no ads or sponsorship banners), free to visit and BYOB. Held in theGolden Gate Park, it’s become a beloved SF institution since it was first held in 2001 and has attracted acts including Emmylou Harris and Led Zeppelin’s Robert Plant.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Namibia": {
        "10.October": {
            "Ranking": 9,
            "Summary": "Namibia has been growing in popularity as a destination since Prince Harry and Meghan Markle spent their honeymoon there last year, and the boom in bookings has sparked a flurry of new lodge openings. Some of the best are making the most of the country’s stargazing opportunities in and around Africa’s only International Dark Sky Reserve (such as the sleek & Beyond Sossusvlei Desert Lodge, with a resident astronomer, and Kwessi Dunes, with open-roofed stargazing rooms in each of its chalets). It’s possible to camp in the reserve too, but book in advance as the limited spaces tend to fill up fast.",
            "URL": "https://www.timeout.com/turkiye/travel/turkiye-best-places-to-visit"
        }
    },
    "Toronto": {
        "10.October": {
            "Ranking": 10,
            "Summary": "Toronto is one of the most exciting cities on the planet, with thrilling nightlife nestled next to gourmet restaurants and some of the finest live music venues on the continent. What makes October the perfect time to visit? Hockey, that’s what. Sure, Maple Leafs fans have suffered more than enough misery over the last half decade-plus, but the regular season isn’t a problem these days. The 2022 Toronto Maple Leafs season gets underway with an away game against Montreal Canadiens on October 12, with the home opener coming the next night against Washington Capitals. Don’t expect to get tickets, but watching a game in a Toronto bar is a bucket list experience.",
            "URL": "https://www.timeout.com/toronto/things-to-do/best-things-to-do-in-toronto"
        }
    },
    "NYC": {
        "10.October": {
            "Ranking": 11,
            "Summary": "It’s pretty much always a good time to visit NYC—atChristmas, you get the snow and ubiquitous festive decorations. In spring, you get theCentral Parkcherry blossom. In summer, you get the long evenings in the feelgood heat, and then fall brings a burnt amber hue to everything. This year, save it forHalloweenwhen the annualTompkins Square Halloween Dog Paradekicks off in Manhattan, shedding NYC’s pooches in a ghoulish new light as pups and their owners come dressed in ever-more outlandish costumes.",
            "URL": "https://www.timeout.com/toronto/things-to-do/best-things-to-do-in-toronto"
        }
    },
    "Thailand": {
        "11.November": {
            "Ranking": 2,
            "Summary": "Post-rainy season, November is a great time to head to Thailand’s jungles and beaches. You can hit all the usual spots, but consider some of Thailand’s lesser-known yet equally beautiful places like Pranburi. With secluded natural beaches and spread-out boutique accommodation options, the area’s still better known for fishing than tourism. There are mangrove forests to explore, and the spectacular Tham Phraya Nakhon cave is just along the coast—inside, the country’s smallest temple is bathed in sunlight from an opening in the rock above.",
            "URL": "https://www.timeout.com/toronto/things-to-do/best-things-to-do-in-toronto"
        }
    },
    "Yukon, Canada": {
        "11.November": {
            "Ranking": 3,
            "Summary": "Attention’s been on Canada’s sparsely populated, mountainous territory Yukon over the last year or so, thanks to the movieCall of the Wild(about a domesticated dog who’s stolen from California and sold to sleigh dog racers, starring Harrison Ford). November marks the start of the winter season in this freezing wilderness—explore on skis, take a snowmobile or go ice-fishing. The film is set in the 1890s, during the Gold Rush, so check out some Klondike Gold Rush history in Dawson City, too. And then wait for the skies to light up with Aurora Borealis at night.",
            "URL": "https://www.timeout.com/canada/things-to-do/best-things-in-canada"
        }
    },
    "Hong Kong": {
        "11.November": {
            "Ranking": 4,
            "Summary": "Hong Kong has always been a looker: with its instantly recognisable skyline of densely packed skyscrapers and lush, green peaks, and its uniquely East-meets-West feel. By November, the drenching heat eases off to a gentle autumn warmth. Tick off Victoria Peak, the Star Ferry and a cable car to the Big Buddha on Lantau Island, then head out to hip hood Sai Ying Pun, on the western side of Hong Kong Island. On its clattering streets, historic dried seafood stalls share space with many hot new cafés, bars and restaurants—including Balinese export Potato Head.",
            "URL": "https://www.timeout.com/canada/things-to-do/best-things-in-canada"
        }
    },
    "Morocco": {
        "11.November": {
            "Ranking": 5,
            "Summary": "WhileMarrakechgot all the attention as Africa’s first Capital of Culture for 2020, history and culture also abound in other Moroccan cities. Take liberal Tangier, for example, with its 1950s beat poet history: Jack Kerouac and Allen Ginsberg drank in The Tangerinn, while William S Burroughs wroteNaked Lunchin Hotel El Muniria. A short hop over the Med from Spain, Tangier’s art galleries offer a sense of this port city’s exciting collision of Europe and African culture, while its medina is smaller and more manageable than Marrakech.",
            "URL": "https://www.timeout.com/canada/things-to-do/best-things-in-canada"
        }
    },
    "Oman": {
        "11.November": {
            "Ranking": 6,
            "Summary": "Where’s the world’s longest zip line? Most people’s first guess wouldn’t be Oman. But the Arabian sultanate has been seriously ramping up its efforts to bring in tourists to the country, with the promise of easy visas and that epic zipline – which is planned for the picturesque mountain village Misfat Al Abriyeen. That has been the plan for a couple of years now, so expect plenty of queues when it eventually opens. But despite its world’s longest zipline bid, Oman is everything nearby Dubai isn’t: generally favouring low-rise Middle Eastern charm and Bedouin traditions over being the biggest or showiest. So expect natural beauty and friendly locals. The almost constant sunshine doesn’t hurt, either.",
            "URL": "https://www.timeout.com/canada/things-to-do/best-things-in-canada"
        }
    },
    "Dublin": {
        "11.November": {
            "Ranking": 7,
            "Summary": "Nothing beats the warm, fuzzy feeling of stepping out of the winter cold and into a warm, cosy pub. And Dublin does an unbeatable line in warm, inviting boozers—from low-lit watering holes that have barely changed since Victorian times to drinking spots known for their live music and rabble-rousing atmosphere. Head to the 250-year-old Long Hall for obscure ales with extra character, The Cobblestone in Smithfield’s for quaintness in spades and live music, or settle in for a session at Toners. It has a short but sweet whisky list and strong literary ties—it’s rumoured to have been the only place WB Yeats would go for a drink.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Tasmania": {
        "11.November": {
            "Ranking": 8,
            "Summary": "Having successfully flipped its image from snoozing backwater to a food and art hotspot with ample natural beauty, Australia’s rugged island state is on a tourism high. To beat the crowds, head over in November before summer truly kicks in. The Change Overnight Hotel, a boutique apartment-style hotel where guests are invited to choose one of eight causes that their stay will contribute to, has been a revelation. Base yourself here to explore the historic city of Launceston, meet the peacocks in the picturesque Cataract Gorge, and visit the Southern Wild Distillery in Devonport for gin made using locally foraged botanicals. Then head south for cultural hub Hobart.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Egypt": {
        "11.November": {
            "Ranking": 9,
            "Summary": "With visitor numbers steadily picking up, you might want to get in there and see the Pyramids quick. As yet the new Grand Egyptian Museum in Cairo remains unopened (sometime in 2023 is the plan), meaning antiquities such as Tutankhamun’s gold mask and a behemoth, 83-tonne, fist-clenching statue of Ramses II are almost within reach. Still, history is tangible here, and it oozes out every nook and cranny. The Sphinx International Airport on the Giza side of the city should make it easier to drop in for an immersive ancient history lesson from the country’s beaches too.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Turkey": {
        "11.November": {
            "Ranking": 10,
            "Summary": "Turkey has been staging a comeback of late, and we're more than happy about that. Socialite season is over and it’s not sunbathing weather anymore – but that means Bodrum's crowds will be gone. Explore the whitewashed Aegean city and its fourth-century BC Mausoleum at Halicarnassus, then check out the castle. Be sure to take inIstanbul, too, especially for the emergingKadıköy district. Its Çiya Sofrası restaurant, serving forgotten Anatolian dishes, also appeared onChef’s Table.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Austria": {
        "12.December": {
            "Ranking": 1,
            "Summary": "December is when Austria really sparkles. Soak up the festive vibes (and the glühwein) at the spiritual HQ of Christmas markets,Vienna. The most iconic is held in front of the illuminated, baroque Schönbrunn Palace, with crafts, gingerbread and an enormous tree, while Art Advent on Karlsplatz has live music and an all-organic policy on the food. And while Vienna may be very good,Salzburg’s a bit subversive, too: at its folkloric Krampus parades in early December, goat-demon characters run riot through the streets. Less scarily, it’s also home to the uniquely Christmassy Salzburg Advent Singing, featuring traditionally dressed Alpine folk choirs and festive markets—the Christkindlmarkt is one of the world’s oldest.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Finland": {
        "12.December": {
            "Ranking": 2,
            "Summary": "This picturesque Nordic nation is a perennial award winner in annual travel gongs, not to mention eco-centric ones, and it makes sense: Finland is big on conservation, with 39 national parks and nearly three-quarters of its land covered in forest. All kinds of cold-weather dwelling creatures live here, from arctic foxes to lynxes, wolverines and snow hares—but go in December to see Rudolph and his chums in the snowy winter paradise that is Finnish Lapland. Where, of course, you’ll also find Santa—this is the home of Christmas, after all.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Cambodia": {
        "12.December": {
            "Ranking": 3,
            "Summary": "For memorable travel moments, Cambodia’s Angkor Wat at sunrise has to be up there. So, how about Cambodia’s Angkor Wat at sunrise, amped up and ready to run a half-marathon? Every December (December 5, to be exact), thousands of runners peg it through the grounds of the 900-year-old Hindu temple, a UNESCO site, in support of Cambodian charities. It’stotallywhat Indiana Jones and Lara Croft would want (bothTemple of DoomandTomb Raiderwere filmed in the complex). Afterwards, head out to one of Cambodia’s quieter tropical beaches for well-deserved lounging: Koh Rong Samloem’s Lazy Beach should fit the bill.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Miami": {
        "12.December": {
            "Ranking": 4,
            "Summary": "For an arty party in the city, it has to beArt Baselin Miami. In December, the Swiss-born contemporary art fair arrives in Miami to exhibit and sell the work of established international artists. But you don’t have to be in the industry, or uber-rich, to get in on the action: plenty of fringe events happen outside the main convention centre atMiami Beachthat same week. Check out the public sculpture and the many pop-ups, gallery events and installations that have led this to be dubbed ‘Art Week’ by locals. Welcome to Miami!",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Kerala, India": {
        "12.December": {
            "Ranking": 5,
            "Summary": "It’s easy to see why tourism inIndia’s serene southwestern state is flourishing, with palm-fringed beaches, tranquil tea plantations, and tiger-spotting opportunities,andit’s also one of India’s more eco enclaves. In forward-looking Kochi, heritage meets hip, between colonial ruins and cutting-edge galleries. Then there is the fabulous Kochi-Muziris Biennale, India’s biggest contemporary art event. Galleries, disused buildings, public spaces and heritage sites across the city are filled with sculpture, film, painting, installations and performance art. Still, that counts as teasing, so best head this way to enjoy India's magical south.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Northern Patagonia": {
        "12.December": {
            "Ranking": 6,
            "Summary": "Because of its vast dark skies, Northern Patagonia is an epic stargazing spot at any time of year, but with a meteor shower and a total eclipse coming up, this December’s the time to go. The sky with be illuminated with cosmic debris for the Geminids meteor shower (it’s a big’un) on 14 and 15 December. Fly intoBuenos Aires,Argentina, a few days before for steak, street art and sexy tango vibes before basing yourself in San Martin de los Andes for the main event—it’s on the banks of a glacial lake and right at the edge of forested Lanín National Park, at the foot of the Andes.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Berlin": {
        "12.December": {
            "Ranking": 8,
            "Summary": "Brave the harsh Berlin winter and reap the rewards: the run-up to Christmas is when the city is at its most charming. Get a round of glühwein while exploring a Christmas market (at Bröhan Museum market products are handmade by locals, while Spandau’s market is all old-Europe vibes). Alexanderplatz’s funfair will be in full swing, while Berlin’s Botanical Garden becomes an illuminated wonderland with twinkling fairy lights and glowing sculptures every December, with an ice rink to slip and slide around. Warm up after a spin by the fire pit with more hot booze.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Mexico City": {
        "12.December": {
            "Ranking": 9,
            "Summary": "With the rainy season and the summer crowds out of the way, December is a great time to hit up Mexico City. Go for the street tacos, tamales and tlacoyos, the Templo Mayor Aztec ruins, and the Frida Kahlo Museum. Then get stuck in to hip neighbourhood Juarez where there are more new design restaurants and bar openings than you can shake a margarita at (if you can find Hanky Panky Cocktail Bar speakeasy, it’ll be worth the hunt). And if you happen to be in the city for New Year’s Eve, make for the nearby Angel of Independence on Reforma Avenue for the street party and fireworks at midnight.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    },
    "Las Vegas": {
        "12.December": {
            "Ranking": 10,
            "Summary": "As the names of artists now getting residencies in Las Vegas get bigger and more relevant (like Lady Gaga and Bruno Mars), so does Sin City’s credibility as an entertainment destination. So do catch ashowwhile you’re there, but since temperatures are pleasantly cool this time of year, now is also the perfect time for exploring off-strip. Want geological beauty? Head to rouge-tinted Red Rock Canyon National Conservation Area. Street art? Go downtown. Mafia stuff? Don’t miss the Mob Museum, with an in-house distillery.",
            "URL": "https://www.timeout.com/dublin/things-to-do/best-things-to-do-in-dublin"
        }
    }
}